Repository: thkoch2001/lxc
Catalog: debian/po/*.po
Languages: da, ja, ru

source: Linux Containers: LXC setup
da: Linuxcontainere: LXC-opsætning
ja: Linux コンテナ: LXC のセットアップ
ru: Linux Containers: настройка LXC

source: Automatically start Linux Containers on boot?
da: Igangsæt automatisk Linuxcontainere ved opstart?
ja: ブート時に Linux コンテナを自動で開始しますか?
ru: Запускать Linux Containers при загрузке автоматически?

source: Linux Containers that have their configuration files copied or symlinked to the /etc/lxc/auto directory can be automatically started during system boot, and shut down on reboot or halt.
da: Linuxcontainere, som får deres konfigurationsfiler kopieret eller symbolsk henvist til mappen /etc/lxc/auto, kan automatisk igangsættes ved systemopstart og lukkes ned ved genstart eller stop.
ja: /etc/lxc/auto ディレクトリにその設定ファイルをコピーまたはシンボリックリンクされている Linux コンテナは、システムのブート時に自動で開始され、再起動あるいは停止時に自動でシャットダウンされます。
ru: Linux Containers, у которых файлы настройки скопированы из или являются символьными ссылками на каталог /etc/lxc/auto, могут запускаться автоматически при включении машины и выключаться при перезагрузке или остановке.

source: If unsure, choose yes (default).
da: Hvis i tvivl, så vælg ja »yes« (standard).
ja: よくわからなければこの質問に「はい」と答えてください (デフォルト)。
ru: Если не уверены, ответьте утвердительно (по умолчанию).

source: Linux Container: Shutdown method
da: Linuxcontainer: Metode for nedlukning
ja: Linux コンテナ: シャットダウンの方法
ru: Linux Container: метод выключения

source: Linux Containers can be shutdown in different ways. The stop method terminates all processes inside the container. The halt method initiates a shutdown, which takes longer and can have problems with containers that don't shutdown themselves properly.
da: Linuxcontainere kan lukkes ned på forskellige måder. Stopmetoden terminerer alle processer inden i containeren. Stop-metoden initierer en nedlukning, som tager længere tid og kan have problemer med containere som ikke lukker sig selv ned korrekt.
ja: Linux コンテナは異なる手法でシャットダウンできます。stop 手法はコンテナ内のすべてのプロセスをターミネートします。halt 手法は shutdown を呼び出しますが、これは stop 手法よりも長くかかり、正常にシャットダウンできないコンテナでは問題となる可能性があります。

source: Unless you know that your containers don't shutdown properly, choose halt (default).
da: Med mindre du ved, at dine containere ikke lukker korrekt ned, så vælg stop (standard).
ja: コンテナが正常にシャットダウンされるか不明であれば、halt を選んでください (デフォルト)。
ru: Если вы знаете, что ваши контейнеры не выключаются правильным образом, выберите остановку (halt, по умолчанию).

source: LXC directory:
da: LXC-mappe:
ja: LXC のディレクトリ:
ru: Каталог LXC:

source: Please specify the directory that will be used to store the Linux Containers.
da: Angiv venligst mappen som vil blive brugt til at lagre Linuxcontainerne.
ja: Linux コンテナを格納するのに利用するディレクトリを指定してください。
ru: Укажите каталог, который будет использован для хранения Linux Containers.

source: If unsure, use /var/lib/lxc (default).
da: Hvis i tvivl, så brug /var/lib/lxc (standard).
ja: よくわからなければ、/var/lib/lxc を使用してください (デフォルト)。
ru: Если не уверены, используйте /var/lib/lxc (по умолчанию).

source: Linux Containers can be shutdown in different ways. The stop method terminates all processes inside the container. The halt method initiates a shutdown, which takes longer and can have problems with containers that don't shutdown themselfs properly.
ru: Работу Linux Containers можно выключать разными способами. Метод stop завершает все процессы внутри контейнера. Метод halt запускает процесс выключения, который выполняется дольше и может привести к проблеме с контейнерами, которые не могут самостоятельно выключиться правильно.
